liaohuiooooo/smart-home-kit-/401_major_node/F401/Major_Node/STM32F401CCU6_LED/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define BT_Pin GPIO_PIN_0
#define BT_GPIO_Port GPIOA
#define BT_EXTI_IRQn EXTI0_IRQn
#define SCL_Pin GPIO_PIN_4
#define SCL_GPIO_Port GPIOA
#define SDA_Pin GPIO_PIN_5
#define SDA_GPIO_Port GPIOA
#define RST_Pin GPIO_PIN_6
#define RST_GPIO_Port GPIOA
#define DC_Pin GPIO_PIN_7
#define DC_GPIO_Port GPIOA
#define TOUCH1_Pin GPIO_PIN_1
#define TOUCH1_GPIO_Port GPIOB
#define TOUCH1_EXTI_IRQn EXTI1_IRQn
#define TOUCH2_Pin GPIO_PIN_2
#define TOUCH2_GPIO_Port GPIOB
#define TOUCH2_EXTI_IRQn EXTI2_IRQn
#define TOUCH3_Pin GPIO_PIN_10
#define TOUCH3_GPIO_Port GPIOB
#define TOUCH3_EXTI_IRQn EXTI15_10_IRQn
/* USER CODE BEGIN Private defines */


/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
